ERP.belugaerp/src/InformationRegisters/бг_СоответствиеОбъектовУПП/бг_СоответствиеОбъектовУПП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_СоответствиеОбъектовУПП</name>
  <resources>
    <name>ОбъектERP</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
      <types>CatalogRef.ЛицензииПоставщиковАлкогольнойПродукции</types>
      <types>CatalogRef.СкидкиНаценки</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.битПунктыНазначения</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Валюты</types>
      <types>CatalogRef.ВидыЦен</types>
      <types>CatalogRef.КлассификаторБанков</types>
      <types>EnumRef.ЮрФизЛицо</types>
      <types>EnumRef.ТипыДоговоров</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.СегментыПартнеров</types>
      <types>EnumRef.бг_creatio_ТипыОбъектовАдреса</types>
      <types>CatalogRef.битГруппыПартнеров</types>
      <types>EnumRef.бг_ТипыЛицензийПоставщиковАлкогольнойПродукции</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <attributes>
    <name>БазаУПП</name>
    <type>
      <types>EnumRef.бг_БазыУПП</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектУПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_СоответствиеОбъектовУПП/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Записывает в регистр сведений информацию осоответствии объектов
// Параметры:
//  ОбъектERP - СправочникСсылка
//  ОбъектУПП - Строка
//
Процедура УстановитьСоответствие(ОбъектERP, ОбъектУПП) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.бг_СоответствиеОбъектовУПП.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ОбъектERP = ОбъектERP;
	МенеджерЗаписи.ОбъектУПП = ОбъектУПП;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция ОбъектУПП(ОбъектERP) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	бг_СоответствиеОбъектовУПП.ОбъектУПП КАК ОбъектУПП
	|ИЗ
	|	РегистрСведений.бг_СоответствиеОбъектовУПП КАК бг_СоответствиеОбъектовУПП
	|ГДЕ
	|	бг_СоответствиеОбъектовУПП.ОбъектERP = &ОбъектERP";
	Запрос.УстановитьПараметр("ОбъектERP", ОбъектERP);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() = 2 Тогда
		Возврат Неопределено;
	Иначе
		Выборка.Следующий();
		Возврат Выборка.ОбъектУПП;
	КонецЕсли;
	
КонецФункции

Функция ОбъектERP(ОбъектУПП) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	бг_СоответствиеОбъектовУПП.ОбъектERP КАК ОбъектERP
	|ИЗ
	|	РегистрСведений.бг_СоответствиеОбъектовУПП КАК бг_СоответствиеОбъектовУПП
	|ГДЕ
	|	бг_СоответствиеОбъектовУПП.ОбъектУПП = &ОбъектУПП";
	Запрос.УстановитьПараметр("ОбъектУПП", ОбъектУПП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() = 2 Тогда
		Возврат Неопределено;
	Иначе
		Выборка.Следующий();
		Возврат Выборка.ОбъектERP;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
